background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overInterDyMFoam ;

startFrom       latestTime;
startTime       0.0;
stopAt          endTime;
endTime         10;
deltaT          0.0005;
writeControl    adjustableRunTime;
writeInterval   0.025;
purgeWrite      0;
writeFormat     ascii;
writePrecision  7;
writeCompression on;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;

maxCo           2;
maxAlphaCo      1;
maxDeltaT       1;

// ************************************************************************* //
