background/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

X0	-3;
Y0	-20;
Z0	-0.001;

X1	3;
Y1	40;
Z1	0.001;

actions
(
    {
        name    a0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     ($X0 $Y0 $Z0) ($X1 $Y1 $Z1);
    }
);

// ************************************************************************* //
